In [1]:
import pandas as pd
url="https://raw.githubusercontent.com/ddaeducation/data/main/brasil-real-estate-2.csv"
brasil_data=pd.read_csv(url)

In [2]:
brasil_data.drop(columns='Unnamed: 0', inplace=True)
brasil_data.head()

,property_type,state,region,lat,lon,area_m2,price_brl
0,apartment,Pernambuco,Northeast,-8.134204,-34.906326,72.0,414222.98
1,apartment,Pernambuco,Northeast,-8.126664,-34.903924,136.0,848408.53
2,apartment,Pernambuco,Northeast,-8.125550,-34.907601,75.0,299438.28
3,apartment,Pernambuco,Northeast,-8.120249,-34.895920,187.0,848408.53
4,apartment,Pernambuco,Northeast,-8.142666,-34.906906,80.0,464129.36

In [3]:
sales_data=pd.read_csv("large_dataset.csv")
sales_data.head()

  Category  Store  Sales  Returns      Date
0        B    4.0  100.0     15.0  1/1/2023
1      NaN    3.0  300.0     15.0  1/2/2023
2        D    2.0  500.0      5.0  1/3/2023
3        C    5.0  400.0     10.0  1/4/2023
4        A    4.0  500.0     10.0  1/5/2023

# Data Manipulation

### 2.1 Data Cleaning

1. **Handling Missing Data**:
   - **`isnull()`**: This function is used to detect missing values in a DataFrame. It returns a DataFrame of the same shape as the original, with `True` for missing values and `False` for non-missing values.
   - **`dropna()`**: This function is used to remove missing values from a DataFrame. You can specify whether to drop rows or columns with missing values.
   - **`fillna()`**: This function is used to fill missing values with a specified value or method (e.g., forward fill, backward fill).

### Isnull()

In [4]:
### Chekcing for missing values
sales_data.isnull().sum()

Category    55
Store       45
Sales       53
Returns     44
Date         9
dtype: int64

In [5]:
# size of the dataset
sales_data.shape

(500, 5)

In [6]:
# len (rows), observatioons
len(sales_data)

500

In [7]:
# Percentage of missing 
sales_data.isnull().sum()*100/len(sales_data)

Category    11.0
Store        9.0
Sales       10.6
Returns      8.8
Date         1.8
dtype: float64

### Dropna()

In [8]:
#
sales_datacopy=sales_data.copy()

In [9]:
sales_datacopy.head()

  Category  Store  Sales  Returns      Date
0        B    4.0  100.0     15.0  1/1/2023
1      NaN    3.0  300.0     15.0  1/2/2023
2        D    2.0  500.0      5.0  1/3/2023
3        C    5.0  400.0     10.0  1/4/2023
4        A    4.0  500.0     10.0  1/5/2023

In [10]:
# use inplace = True, to keep the new data
sales_datacopy.dropna(inplace=True)

In [11]:
# Checking the missing values
sales_datacopy.isnull().sum()

Category    0
Store       0
Sales       0
Returns     0
Date        0
dtype: int64

In [12]:
sales_datacopy.shape

(326, 5)

### Fillna(), Replacement

In [13]:
sales_data.head()

  Category  Store  Sales  Returns      Date
0        B    4.0  100.0     15.0  1/1/2023
1      NaN    3.0  300.0     15.0  1/2/2023
2        D    2.0  500.0      5.0  1/3/2023
3        C    5.0  400.0     10.0  1/4/2023
4        A    4.0  500.0     10.0  1/5/2023

- Replace missing value with Mean
- Replace missing value with Median
- Replace missing value with Mode

In [14]:
sales_data["Date"]=pd.to_datetime(sales_data["Date"],errors='coerce' )

In [15]:
sales_data.isna().sum()

Category    55
Store       45
Sales       53
Returns     44
Date         9
dtype: int64

### Replace missing value with Mean

In [16]:
sales_data['Sales'].mean()

287.91946308724835

In [17]:
media_store=sales_data['Store'].median()
sales_data["Store"].fillna(media_store, inplace=True)

In [18]:
sales_data['Sales'].fillna(sales_data['Sales'].mean(), inplace=True)

In [19]:
sales_data["Category"].fillna(sales_data['Category'].mode(), inplace=True)

In [20]:
sales_data.isna().sum()

Category    55
Store        0
Sales        0
Returns     44
Date         9
dtype: int64

2. **Renaming Columns and Rows**:
   - You can rename columns using the `rename()` method, passing a dictionary that maps old names to new names.
   - `df = df.rename(columns={"old_name1": "new_name1", "old_name2": "new_name2"})`

   - For renaming rows (index), you can also use the `rename()` method with the `index` parameter.
   - `df = df.rename(index={"row1": "new_row1", "row2": "new_row2"})`

In [21]:
sales_data.columns

Index(['Category', 'Store', 'Sales', 'Returns', 'Date'], dtype='object')

In [22]:
sales_data=sales_data.rename(columns={"Category":"Cat","Returns":"ROI"})
sales_data.head(2)

   Cat  Store  Sales   ROI       Date
0    B    4.0  100.0  15.0 2023-01-01
1  NaN    3.0  300.0  15.0 2023-01-02

In [23]:
sales_data=sales_data.set_index("Cat")

In [24]:
sales_data.head()

     Store  Sales   ROI       Date
Cat
B      4.0  100.0  15.0 2023-01-01
NaN    3.0  300.0  15.0 2023-01-02
D      2.0  500.0   5.0 2023-01-03
C      5.0  400.0  10.0 2023-01-04
A      4.0  500.0  10.0 2023-01-05

In [25]:
sales_data.rename(index={"B":"Product B"})

           Store  Sales   ROI       Date
Cat
Product B    4.0  100.0  15.0 2023-01-01
NaN          3.0  300.0  15.0 2023-01-02
D            2.0  500.0   5.0 2023-01-03
C            5.0  400.0  10.0 2023-01-04
A            4.0  500.0  10.0 2023-01-05
...          ...    ...   ...        ...
Product B    1.0  400.0  20.0 2024-05-10
C            3.0  400.0   NaN 2024-05-11
A            1.0  300.0   5.0 2024-05-12
NaN          3.0  200.0   5.0 2024-05-13
NaN          3.0  500.0  10.0 2024-05-14

[500 rows x 4 columns]

3. **Dropping Duplicates**:
   - **`drop_duplicates()`**: This function is used to remove duplicate rows from a DataFrame. You can specify which columns to consider for identifying duplicates.

In [26]:
sales_data.duplicated().sum()

1

In [27]:
sales_data.drop_duplicates(inplace=True)

In [28]:
sales_data.duplicated().sum()

0

### 2.2 Data Transformation

1. **Filtering and Conditional Selections**:
   - You can filter DataFrames using boolean indexing, where you create a boolean mask based on conditions.
   - `mask = df["A"] > 25 to filtered_df = df[mask]

In [29]:
sales_data.reset_index(inplace=True)
sales_data.head()

   Cat  Store  Sales   ROI       Date
0    B    4.0  100.0  15.0 2023-01-01
1  NaN    3.0  300.0  15.0 2023-01-02
2    D    2.0  500.0   5.0 2023-01-03
3    C    5.0  400.0  10.0 2023-01-04
4    A    4.0  500.0  10.0 2023-01-05

In [36]:
mask_400=sales_data['Sales']>=400
sales_data[mask_400].head()

  Cat  Store  Sales   ROI       Date
2   D    2.0  500.0   5.0 2023-01-03
3   C    5.0  400.0  10.0 2023-01-04
4   A    4.0  500.0  10.0 2023-01-05
5   A    1.0  400.0  10.0 2023-01-06
6   A    3.0  400.0  15.0 2023-01-07

In [39]:
mask_d=sales_data['Cat']=='D'
sales_data[mask_d].head()

   Cat  Store       Sales   ROI       Date
2    D    2.0  500.000000   5.0 2023-01-03
7    D    5.0  500.000000  15.0 2023-01-08
9    D    4.0  300.000000  20.0 2023-01-10
12   D    3.0  287.919463   NaN 2023-01-13
25   D    3.0  300.000000  10.0 2023-01-26

In [42]:
sales_data[mask_400 & mask_d].head()

   Cat  Store  Sales   ROI       Date
2    D    2.0  500.0   5.0 2023-01-03
7    D    5.0  500.0  15.0 2023-01-08
35   D    3.0  400.0   5.0 2023-02-05
53   D    3.0  400.0  25.0 2023-02-23
62   D    1.0  400.0  20.0 2023-03-04

`2. **Adding New Columns**:
   - You can add new columns to a DataFrame by assigning a new Series or a calculated value to a new column name.
   - `df["Sum"] = df["A"] + df["B"]`

3. **Sorting**:
   - **`sort_values()`**: This function is used to sort a DataFrame by one or more columns.
   - `sorted_df = df.sort_values(by=["A", "B"], ascending=[True, False])`
   - `sorted_df = df.sort_values(by="C", na_position="last")`
   - `df.sort_values(by="B", inplace=True)`

3. **Ranking**:
   - **`rank()`**: This function assigns ranks to entries in a DataFrame based on the values in a specified column.
   - `df['A_rank'] = df['A'].rank()`
   - `df['A_rank_desc'] = df['A'].rank(ascending=False, pct=True)`

#### **Using `groupby` and `agg` in Pandas**
The `groupby` and `agg` functions in pandas are powerful tools for data aggregation and analysis. Here's how to use them effectively:**sales _dataset.csv**

**Multiple aggregations using agg**
- `result = df.groupby('Category').agg({ `
- `'Sales': ['sum', 'mean', 'max'],`
- `'Returns': ['mean', 'min', 'max']
})`

**Named aggregations**
- `named_agg = df.groupby('Category').agg(`
- `total_sales=('Sales', 'sum'),`
- `avg_sales=('Sales', 'mean'),`
- `max_returns=('Returns', 'max'),
)`

### 2.3 Hands-on Practice

For hands-on practice, you can use the following Python packages:
- **Pandas**: This is the primary package for data manipulation and analysis in Python. It provides all the functions mentioned above.
- **NumPy**: Useful for numerical operations and handling arrays, which can be helpful in data manipulation tasks.

Use this dataset [sample_data](https://github.com/ddaeducation/data/blob/main/sample_data.csv):


### **2.3.1 Data Cleaning**

#### **Handling Missing Data**
1. **Identifying Missing Values:**
   - How many missing values are there in each column? 
   - Identify which rows have missing values in the `weight` column.

2. **Dropping Missing Values:**
   - Remove all rows with missing values. How many rows remain in the dataset?

3. **Filling Missing Values:**
   - Fill missing `weight` values with the mean weight of the dataset.
   - Fill missing `income` values with the median income of the dataset.

---

4.  **Renaming Columns and Rows**
   Rename the column names to be more descriptive. For example:
   - `age` -> `Age (Years)`
   - `gender` -> `Gender`
   - `height` -> `Height (cm)`
   - `weight` -> `Weight (kg)`
   - `income` -> `Annual Income (RWF)`


5. **Dropping Duplicates**
   Check for duplicate rows in the dataset. If duplicates exist, remove them. How many 
    duplicates were removed?

---

### **2.3.2 Data Transformation**

#### **Filtering and Conditional Selections**
6. **Basic Filtering:**
   - Extract all rows where `gender` is "Female."
   - Extract rows where `age` is greater than 35 and `income` is less than 100,000.

7. **Advanced Filtering:**
   - Filter rows where `Height (cm)` is above the average height in the dataset.

---

#### **Adding New Columns**
8. Create a new column called `BMI` (Body Mass Index) using the formula:  
 
   `BMI = Weight(kg)/Height(m)^2`
   
   - Note: Convert height from cm to meters.

#### **Sorting and Ranking**
10. Sort the dataset by `Annual Income (RWF)` in descending order.
11. Assign a rank to individuals based on their `Annual Income (RWF)`.

---

### **2.3.3 Answer the Following Questions**

14. **Exploratory Questions:**
    - What is the average `Annual Income (RWF)` for "Female" individuals?
    - What is the average `BMI` for individuals in the "Senior" age group?

---

These questions will guide participants through **data cleaning**, **transformation**, and **analysis**, providing hands-on practice with the dataset.


The code should demonstrates how to handle missing data, rename columns, drop duplicates, add a calculated column, and filter the DataFrame based on a condition. You can modify the dataset and conditions as needed for your exercises.

### Body Mass Index Formula

In [30]:
from IPython.display import display, Math
display(Math(r'BMI = \frac{\text{Weight (kg)}}{\left(\text{Height (m)}\right)^2}'))